OpenFOAM-13/test/Lagrangian/injections/0/Lagrangian/parcel/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianVectorField;
    location    "0/Lagrangian/parcel";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ".*"
    {
        type            reboundVelocity;
        e               0.97;
        mu              0.09;
    }
}

sources
{
    manualInjection
    {
        type            uniformFixedValue;
        uniformValue    (0 -0.1 0);
    }
}


// ************************************************************************* //
